[
  {
    "id": 102,
    "title": "Infosys",
    "tenure": "July 2024 - Present",
    "position": "Associate Consulant Software Engineer",
    "url": "https://infosys.com",
    "description": "Joined Infosys to further enhance my career and to take up on new challenges and explore new opportunities in July 2024.",
    "bullets": [
      {
        "id": 20101,
        "text": "Working for one of the big-4 to develop and enhance their flagship mobility pathway platform, which is a scalable, integrated mobility solution that enables the firm's client s and engagement teams to manage and coordinate coplex mobility services across the end-to-end mobile talent lifecycle via a single platform."
      },
      {
        "id": 20102,
        "text": "Developed a Bulk Case creation feature for the app that lead to a significant increase in the number of cases created in a short amount of time and reducing manual effort by more than 80%."
      }
    ]
  },
  {
    "id": 101,
    "title": "DXC Technology",
    "tenure": "Feb 2021 - June 2024",
    "position": "Analyst 1 Software Engineer",
    "url": "https://dxc.com/us/en/",
    "description": "I joined DXC as an Associate Professional Software Engineer fresher where I got my first professional project with NAB(National Australia Bank) where I learned all about ReactJS front-end web-development from best of the mentors who were from India, Australia, Philippines & Vietnam. Experienced working with agile methodologies, using 3rd party UI Toolkit libraries & constantly evolving client requirements. Later got promoted to Analyst 1 Software Engineering.",
    "bullets": [
      {
        "id": 10101,
        "text": "Wrote accessible, reusable, interactive and unit-tested react components for clients that can be used across different internal projects"
      },
      {
        "id": 10102,
        "text": "Engineered and maintained code for client primarily using TypeScript, ReactJS,styled-components and GraphQL"
      },
      {
        "id": 10103,
        "text": "Communicate with teams of UI-engineers, UX-designers, testers and clients on day-to-day basis"
      },
      {
        "id": 10104,
        "text": "Utilized MUI (Material-UI) and Kendo React components to design and implement beautiful and user-friendly interfaces"
      },
      {
        "id": 10105,
        "text": "Collaborated with backend developers to structure the correct data responses from the APIs ensuring smoothfrontend-backend integration."
      }
    ]
  }
]
